Revit 2020 API
ImageTypeOptions Members
The ImageTypeOptions type exposes the following members.
Constructors
Name | Description
ImageTypeOptions()
 Constructs a new instance of the ImageTypeOptions object.
ImageTypeOptions(String)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
ImageTypeOptions(ExternalResourceReference)
 Constructs a new instance of the ImageTypeOptions object.
ImageTypeOptions(String, Boolean)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
This constructor saves an additional setting that indicates whether the path used by ImageType should be absolute or relative.
Methods
Name | Description
Dispose
Releases all resources used by the ImageTypeOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 If true the ImageTypeOptions can be used to create or reload an ImageType.
SetExternalResourceReference
 Update the external resource reference to an image.
SetPath(String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
SetPath(String, Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PageNumber
 The page in the file to be used for the image
Path
 The path of the file that specifies the image to be used.
Resolution
 The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image.
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace